export const data = [
    {
        period: "2023г по Текущий",
        company: "Компания Fly.tj (Антарес)",
        position: "FRONTEND РАЗРАБОТЧИК",
        desc: [
            "Предоставлял техническую поддержку B2C-продукта fly.tj, а также двум партнёрским сервисам: B2C flytrip.uz и B2B agent.flytrip.uz.",
            "Поддерживал легаси-код, выполняя рефакторинг и оптимизацию приложения на React 16.",
            "Искал и исправлял баги, вызванные изменениями в структуре данных от поставщика авиабилетов, предотвращая сбои в работе приложений.",
            "Разработал новые функции по запросу руководства, включая отображение информации о маршруте в модальном окне, корзину бронированных авиабилетов, поиск сохранённых пассажиров и другие улучшения.",
            "Создал макеты новых страниц и реализовал их в проектах на основе разработанных дизайнов.",
            "Очистил проект fly.tj от старых и неиспользуемых медиафайлов, а также удалил неактивный код после рефакторинга отдельных компонентов, что улучшило скорость загрузки страниц.",
            "",
            "Разработал обновлённую версию пользовательского интерфейса B2B-продукта в рамках проекта business.fly.tj.",
            "Выполнял семантическую и кроссбраузерную вёрстку, обеспечивая доступность и корректное отображение во всех популярных браузерах.",
            "Адаптировал вёрстку под разные устройства, используя современные CSS-технологии (Grid, clamp() и др.), что повысило удобство взаимодействия с интерфейсом.",
            "Разработал и внедрил цветовые схемы для тёмной темы сервиса, улучшив удобство работы пользователей в условиях низкой освещённости.",
            "Интегрировал фронтенд с бэкендом, обеспечив получение и обработку данных на клиенте, а также отправку данных на сервер."

        ],
        stack: "JavaScript( TypeScript( React( Redux, TailwindCSS, StyledComponents, ...Other_packages ), NextJS( Zustand, Zod, ShadcnUI, ...Other_packages)))",
        portfolio: ["https://business-module-self.vercel.app/info", "fly.tj", "flytrip.uz", "business.fly.tj"]
    },
    {
        period: "2022г по 2023г",
        company: "Livo Outsource Company",
        position: "FRONTEND РАЗРАБОТЧИК",
        desc: [
            "Самостоятельно изучал и освоил основы библиотеки React.",
            "Закрепил знания JavaScript-фреймворка Vue.js, оценив его преимущества, такие как эффективное разбиение приложения на переиспользуемые компоненты и удобная передача данных разных типов (строка, массив, объект), а также обработка событий клавиатуры и мыши между компонентами Vue.",
            "Разрабатывал пользовательские интерфейсы веб-приложений с использованием Vue.js и Nuxt.js.",
            "Работал с дополнительными библиотеками, такими как Axios, Vue Router, Vuex и другими инструментами для улучшения функциональности приложений.",
            "Взаимодействовал с backend API, выполняя запросы через Axios или метод Fetch в централизованном хранилище Vuex, а затем использовал полученные данные в компонентах.",
            "Изучал тематику проекта, подбирал подходящие шаблоны и разрабатывал различные сайты на платформе WordPress."
        ],
        portfolio: ["https://www.diardushanbe.com/", "https://mdis.edu.tj/"]
    },
    {
        period: "2019г по 2022 г",
        company: "Самозанятость, Фрилансер",
        position: "ВЕБ-РАЗРАБОТЧИК",
        desc: [
            "На ранних стадиях становления разработчиком изучал HTML и CSS, а также брал заказ на один простой проект — информационный сайт, который успешно сверстал задеплоил на хостинг и привязал домен.",
            "На последующих проектах отточил навыки и ещё лучше понял CSS, а также тонкости и принципы адаптивной и кроссбраузерной вёрстки.",
            "Изучал основы движка WordPress и освоил эту CMS вдоль и поперёк, так как большинство учебных и коммерческих проектов выполнял с её помощью.",
            "Изучал основы языка программирования JavaScript для добавления интерактивности на веб-сайт с клиентской стороны, а именно работу с DOM-элементами: перебор HTML-документа в JS (теги, классы и ID), прослушивание различных событий и их обработка.",
            "Практикуя на учебных и коммерческих проектах, освоил CSS-технологию Grid Layout для более эффективного и элегантного решения адаптивной вёрстки.",
            "Изучал основы JavaScript и CSS-фреймворков Vue.js и Tailwind CSS.",
        ],
    }
]